<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of AppleConnect and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.xbstech.grahamgilbert.AppleConnect.munki</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>AppleConnect</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/Apple/AppleConnect</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>AppleConnect is an application for authenticating into AppleConnect-enabled applications. AppleConnect with Single Sign On enables you to sign in once and gain automatic access to all AppleConnect SSO-enabled applications without having to reenter your AppleConnect account name and password each time.
</string>
            <key>display_name</key>
            <string>AppleConnect</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.xbstech.grahamgilbert.AppleConnect.download</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
